docs/evidence/k8s-load-baseline/k6.txt
time="2026-09-26T06:05:03Z" level=warning msg="Insufficient VUs, reached 500 active VUs and cannot initialize more" executor=ramping-arrival-rate scenario=reads


  â–ˆ THRESHOLDS 

    checks
    âœ— 'rate==1' rate=99.11%

    dropped_iterations
    âœ— 'count==0' count=2002

    http_req_failed
    âœ— 'rate==0' rate=0.88%


  â–ˆ TOTAL RESULTS 

    checks_total.......: 9844   162.526289/s
    checks_succeeded...: 99.11% 9757 out of 9844
    checks_failed......: 0.88%  87 out of 9844

    âœ— read returns 200
      â†³  99% â€” âœ“ 9757 / âœ— 87

    HTTP
    http_req_duration..............: avg=1.32s min=274.62Âµs med=1.4s  max=3.64s p(90)=2.74s p(95)=3.12s
      { expected_response:true }...: avg=1.33s min=1.3ms    med=1.41s max=3.64s p(90)=2.74s p(95)=3.13s
    http_req_failed................: 0.88%  87 out of 9844
    http_reqs......................: 9844   162.526289/s

    EXECUTION
    dropped_iterations.............: 2002   33.053396/s
    iteration_duration.............: avg=1.32s min=377.32Âµs med=1.4s  max=3.64s p(90)=2.74s p(95)=3.12s
    iterations.....................: 9844   162.526289/s
    vus............................: 372    min=0          max=500
    vus_max........................: 500    min=100        max=500

    NETWORK
    data_received..................: 41 MB  670 kB/s
    data_sent......................: 877 kB 15 kB/s



time="2026-09-26T06:05:36Z" level=error msg="test run was aborted because k6 received a 'interrupt' signal"